app/Http/Controllers/Auth/AuthenticatedSessionController.php

update `users` set `last_login_at` = '2024-01-19 06:15:44', `users`.`updated_at` = '2024-01-19 06:15:44' where `id` = 1
---
    public function store(LoginRequest $request)
    {
        //ReCpatcha
        $settings = Utility::settings();
        //ReCpatcha
        if(isset($settings['recaptcha_module']) && $settings['recaptcha_module'] == 'on')
        {
            $validation['g-recaptcha-response'] = 'required|captcha';
        }else{
            $validation = [];
        }

        $this->validate($request, $validation);

        $request->authenticate();

        $user = Auth::user();

        if($user->delete_status == 0)
        {
            auth()->logout();
        }

        if($user->is_active == 0)
        {
            auth()->logout();
        }
        // Update Last Login Time
        $user->update(
            [
                'last_login_at' => Carbon::now()->toDateTimeString(),
            ]
        );