app/Http/Controllers/ClientController.php

    public function index()
    {
        if(\Auth::user()->can('manage client'))
        {
            $user    = \Auth::user();
            $clients = User::where('created_by', '=', $user->creatorId())->where('type', '=', 'client')->get();
---
select * from `users` where `created_by` = 1 and `type` = 'client'