app/Http/Controllers/EmployeeController.php

    public function index()
    {
        if(\Auth::user()->can('manage employee'))
        {
            if(Auth::user()->type == 'Employee')
            {
                $employees = Employee::where('user_id', '=', Auth::user()->id)->with(['branch','department','designation'])->get();
            }
            else
            {
                $employees = Employee::where('created_by', \Auth::user()->creatorId())->with(['branch','department','designation'])->get();
---
select * from `branches` where `branches`.`id` in (0)
select * from `departments` where `departments`.`id` in (0)
select * from `designations` where `designations`.`id` in (0)
select * from `employees` where `created_by` = 1