app/Http/Controllers/InvoiceController.php

select * from `custom_fields` where `created_by` = 1 and `module` = 'invoice'
---
    public function create($customerId)
    {

        if(\Auth::user()->can('create invoice'))
        {
            $customFields   = CustomField::where('created_by', '=', \Auth::user()->creatorId())->where('module', '=', 'invoice')->get();

select * from `invoices` where `created_by` = 1 order by `created_at` desc limit 1
---
    function invoiceNumber()
    {
        $latest = Invoice::where('created_by', '=', \Auth::user()->creatorId())->latest()->first();