app/Http/Controllers/PurchaseController.php

select * from `custom_fields` where `created_by` = 1 and `module` = 'purchase'
---
    public function create($vendorId)
    {
        if(\Auth::user()->can('create purchase'))
        {
            $customFields = CustomField::where('created_by', '=', \Auth::user()->creatorId())->where('module', '=', 'purchase')->get();

select * from `purchases` where `created_by` = 1 order by `created_at` desc limit 1
---
    function purchaseNumber()
    {
        $latest = Purchase::where('created_by', '=', \Auth::user()->creatorId())->latest()->first();

select * from `purchase_products` where `purchase_id` = '1' and `product_id` = '1' limit 1
---
    public function items(Request $request)
    {

        $items = PurchaseProduct::where('purchase_id', $request->purchase_id)->where('product_id', $request->product_id)->first();