app/Http/Controllers/WarehouseController.php

select * from `warehouse_products` where `warehouse_id` = 2 limit 1
select exists(select * from `warehouse_products` where `warehouse_id` = 2) as `exists`
select * from `warehouse_products` where `warehouse_id` = 2 and `created_by` = 1
---
    public function show(warehouse $warehouse)
    {

        $id = WarehouseProduct::where('warehouse_id', $warehouse->id)->first();

        if (\Auth::user()->can('show warehouse')) {
            //            dd($warehouse->id);

            if (WarehouseProduct::where('warehouse_id', $warehouse->id)->exists()) {

                $warehouse = WarehouseProduct::where('warehouse_id', $warehouse->id)->where('created_by', '=', \Auth::user()->creatorId())->get();