app/Models/Utility.php

select * from `settings` where `created_by` = 1
---
    public static function getSetting()
    {
        if (self::$getsettings == null) {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', 1)->get();
            if (count($data) == 0) {
                $data = DB::table('settings')->where('created_by', '=', 1)->get();

select * from `settings` where `created_by` = 1
---
    public static function getSettingById($id)
    {
        if (self::$getsettingsid == null) {
            $data = DB::table('settings');
            $data = $data->where('created_by', '=', $id)->get();

select `full_name`, `code` from `languages`
---
    public static function languages()
    {
        if (self::$langData == null) {
            $languages = Utility::langList();

            if (\Schema::hasTable('languages')) {
                $settings = Utility::settings();
                if (!empty($settings['disable_lang'])) {
                    $disabledlang = explode(',', $settings['disable_lang']);
                    $languages = Language::whereNotIn('code', $disabledlang)->pluck('full_name', 'code');
                } else {
                    $languages = Language::pluck('full_name', 'code');

select * from `company_payment_settings` where `created_by` = 1
---
    public static function getCompanyPaymentSetting($user_id)
    {

        $data = \DB::table('company_payment_settings');
        $settings = [];
        $data = $data->where('created_by', '=', $user_id);
        $data = $data->get();

select `value`, `name` from `settings` where `created_by` = 1
select * from `users` where `type` = 'company' limit 1
---
    public static function colorset()
    {
        if (\Auth::check()) {
            $setting = DB::table('settings')->where('created_by', \Auth::user()->creatorId())->pluck('value', 'name')->toArray();
        } else {

            $user = User::where('type', 'company')->first();

select * from `settings` where `name` in ('meta_title', 'meta_desc', 'meta_image')
---
    public static function getSeoSetting()
    {
        $data = \DB::table('settings')->whereIn('name', ['meta_title', 'meta_desc', 'meta_image'])->get();

select * from `settings` where `name` in ('enable_cookie', 'cookie_logging', 'cookie_title', 'cookie_description', 'necessary_cookies', 'strictly_cookie_title', 'strictly_cookie_description', 'more_information_description', 'contactus_url')
---
    public static function getCookieSetting()
    {

        $data = \DB::table('settings')->whereIn('name', ['enable_cookie', 'cookie_logging', 'cookie_title',
            'cookie_description', 'necessary_cookies', 'strictly_cookie_title',
            'strictly_cookie_description', 'more_information_description', 'contactus_url'])->get();